In [ ]:
# Topics to cover for today -
# (1) Label Encoder
# (2) One Hot Encoder (Using pd.get_dummies)
# (3) Concatenate
# (4) Append

In [33]:
!pip install sklearn

Requirement already satisfied: sklearn in c:\python\lib\site-packages (0.0.post1)

In [34]:
! pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\python\lib\site-packages (1.2.2)
Requirement already satisfied: numpy>=1.17.3 in c:\python\lib\site-packages (from scikit-learn) (1.24.2)
Requirement already satisfied: scipy>=1.3.2 in c:\python\lib\site-packages (from scikit-learn) (1.10.1)
Requirement already satisfied: joblib>=1.1.1 in c:\python\lib\site-packages (from scikit-learn) (1.2.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\python\lib\site-packages (from scikit-learn) (3.1.0)

In [35]:
# Importing important libraries
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder

In [36]:
# Importing the dataset
df = pd.read_csv('Mall_Customers_BP.csv')
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [37]:
# Checking for null values
df.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [38]:
# Applying label encoding technique on 'genre' column
encoder = LabelEncoder()

df['Genre'] = encoder.fit_transform(df["Genre"])
df.head()

   CustomerID  Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1      1   19                  15                      39
1           2      1   21                  15                      81
2           3      0   20                  16                       6
3           4      0   23                  16                      77
4           5      0   31                  17                      40

In [39]:
encoder = LabelEncoder()

df['Age'] = encoder.fit_transform(df["Age"])
df.head()

   CustomerID  Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1      1    1                  15                      39
1           2      1    3                  15                      81
2           3      0    2                  16                       6
3           4      0    5                  16                      77
4           5      0   13                  17                      40

In [40]:
# One Hot Encoder with get dummies
dummy = pd.get_dummies(df['Genre'])

In [42]:
# Importing the dataset
df = pd.read_csv('Mall_Customers_BP.csv')
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [43]:
# Merging the two columns
df = pd.merge(df,dummy, right_index=True, left_index=True)
df = df.drop('Genre', axis=1)
df

     CustomerID  Age  Annual Income (k$)  Spending Score (1-100)  0  1
0             1   19                  15                      39  0  1
1             2   21                  15                      81  0  1
2             3   20                  16                       6  1  0
3             4   23                  16                      77  1  0
4             5   31                  17                      40  1  0
..          ...  ...                 ...                     ... .. ..
195         196   35                 120                      79  1  0
196         197   45                 126                      28  1  0
197         198   32                 126                      74  0  1
198         199   32                 137                      18  0  1
199         200   30                 137                      83  0  1

[200 rows x 6 columns]

In [ ]:
# Creating dataset
data1 = {'Name' : ['Pranav', 'Sai', 'Niraj', 'Vijay'],
        'Age' : [27,28,29,30],
        'Address' : ['Nagpur', 'Kanpur', 'Satara', 'Pune'],
        'Qualification' : ['ME', 'MBA', 'MSC', 'MCA']}

data2 = {'Name' : ['Rahul', 'Ayushi', 'Sharvari', 'Dhiraj'],
        'Age' : [22,23,24,25],
        'Address' : ['Mumbai', 'Delhi', 'Wardha', 'Vizag'],
        'Qualification' : ['BE', 'BA', 'BCOM', 'BCA']}

# Converting dictionaries to dataframes
df = pd.DataFrame(data1, index = [0,1,2,3])
df1 = pd.DataFrame(data2, index = [4,5,6,7])

# Printing the dataset
print(df, '\n\n', df1)

In [ ]:
# Concatenating the two given dataframes

In [ ]:
# Exploring axis and join argument in pd.concat

In [ ]:
# Creating dataset
data1 = {'Name' : ['Pranav', 'Sai', 'Niraj', 'Vijay'],
        'Age' : [27,28,29,30],
        'Address' : ['Nagpur', 'Kanpur', 'Satara', 'Pune'],
        'Qualification' : ['ME', 'MBA', 'MSC', 'MCA']}

data2 = {'Name' : ['Rahul', 'Ayushi', 'Sharvari', 'Dhiraj'],
        'Age' : [22,23,24,25],
        'Address' : ['Mumbai', 'Delhi', 'Wardha', 'Vizag'],
        'Qualification' : ['BE', 'BA', 'BCOM', 'BCA']}

# Converting dictionaries to dataframes
df = pd.DataFrame(data1, index = [0,1,2,3])
df1 = pd.DataFrame(data2, index = [2,3,6,7])

# Printing the dataset
print(df, '\n\n', df1)

In [ ]:
# Concatenating

In [ ]:
# Sort argument in concatenating

In [ ]:
# append() function

In [ ]:
# Creating dataset
data1 = {'Name' : ['Pranav', 'Sai', 'Niraj', 'Vijay'],
        'Age' : [27,28,29,30],
        'Address' : ['Nagpur', 'Kanpur', 'Satara', 'Pune'],
        'Qualification' : ['ME', 'MBA', 'MSC', 'MCA']}

data2 = {'Name' : ['Rahul', 'Ayushi', 'Sharvari', 'Dhiraj'],
        'Age' : [22,23,24,25],
        'Address' : ['Mumbai', 'Delhi', 'Wardha', 'Vizag'],
        'Qualification' : ['BE', 'BA', 'BCOM', 'BCA']}

# Converting dictionaries to dataframes
df = pd.DataFrame(data1, index = [0,1,2,3])
df1 = pd.DataFrame(data2, index = [4,5,6,7])

# Printing the dataset
print(df, '\n\n', df1)

In [ ]:
# Using append function
res = df.append(df1)
res

In [ ]:
# Creating dataset
data1 = {'Name' : ['Pranav', 'Sai', 'Niraj', 'Vijay'],
        'Age' : [27,28,29,30],
        'Address' : ['Nagpur', 'Kanpur', 'Satara', 'Pune'],
        'Qualification' : ['ME', 'MBA', 'MSC', 'MCA']}

data2 = {'Name' : ['Rahul', 'Ayushi', 'Sharvari', 'Dhiraj'],
        'Age' : [22,23,24,25],
        'Address' : ['Mumbai', 'Delhi', 'Wardha', 'Vizag'],
        'Qualification' : ['BE', 'BA', 'BCOM', 'BCA']}

# Converting dictionaries to dataframes
df = pd.DataFrame(data1, index = [0,1,2,3])
df1 = pd.DataFrame(data2, index = [2,3,6,7])

# Printing the dataset
print(df, '\n\n', df1)

In [ ]:
# ignore_index argument

In [ ]:
# Creating dataset
data1 = {'Name' : ['Pranav', 'Sai', 'Niraj', 'Vijay'],
        'Age' : [27,28,29,30],
        'Address' : ['Nagpur', 'Kanpur', 'Satara', 'Pune'],
        'Qualification' : ['ME', 'MBA', 'MSC', 'MCA']}

data2 = {'Name' : ['Rahul', 'Ayushi', 'Sharvari', 'Dhiraj'],
        'Age' : [22,23,24,25],
        'Address' : ['Mumbai', 'Delhi', 'Wardha', 'Vizag'],
        'Qualification' : ['BE', 'BA', 'BCOM', 'BCA']}

# Converting dictionaries to dataframes
df = pd.DataFrame(data1, index = [0,1,2,3])
df1 = pd.DataFrame(data2, index = [4,5,6,7])

# Printing the dataset
print(df, '\n\n', df1)

In [ ]:
# concatenating using keys

In [ ]:
# Creating dataset
data1 = {'Name' : ['Pranav', 'Sai', 'Niraj', 'Vijay'],
        'Age' : [27,28,29,30],
        'Address' : ['Nagpur', 'Kanpur', 'Satara', 'Pune'],
        'Qualification' : ['ME', 'MBA', 'MSC', 'MCA']}

# Converting dictionaries to dataframes
df = pd.DataFrame(data1, index = [0,1,2,3])

# Creating a series
s1 = pd.Series([1000, 2000, 3000, 4000], name = 'Salary')
print(df, '\n\n', s1)

In [ ]:
# Concatenating a dataframe and a series

In [ ]:
# Getting the data types

In [ ]:
# Converting int64 to int8

In [ ]:
# Converting int64 to float

In [ ]:
# Concatenating a dataframe and a series

In [ ]:
# Getting the data types

In [ ]:
# Converting multiple columns

In [ ]:
# Concatenating a dataframe and a series

In [ ]:
# Getting the data types

In [ ]:
# Using downcast argument

In [ ]:
# Concatenating a dataframe and a series

In [ ]:
# Getting the data types